Repository: alt-cloud/podsec
Catalog: podsec-k8s-rbac/po/podsec-k8s-rbac.po
Languages: ru

source: username
ru: пользователь

source: role
ru: роль

source: role_bundle_name
ru: имя_связки_роли

source: User
ru: Пользователь

source: does not exist
ru: не существует

source: Invalid cluster role type
ru: Неверный тип кластерной роли

source: namespace is not applicable to cluster role
ru: namespace неприменимо к кластерной роли

source: When binding a regular role, you must specify a namespace
ru: При привязке обычной роли необходимо указать namespace

source: Cluster role
ru: Кластерная роль

source: Role
ru: Роль

source: absent
ru: отсутствует

source: Format
ru: Формат

source: user
ru: пользователь

source: directory
ru: каталог

source: No rights to access the directory
ru: Нет прав на доступ в каталог

source: Creating a personal
ru: Создание личного

source: key
ru: ключа

source: Private key file
ru: Файл личного ключа

source: not created
ru: не создан

source: created
ru: создан

source: Creating a Certificate Signing Request
ru: Создание запроса на подпись сертификата

source: Certificate Signing Request file
ru: Файл запроса на подпись сертификата

source: Writing CSR certificate signing request to cluster
ru: Запись запроса на подпись сертификата

source: Certificate signing request failed
ru: Запрос на подпись сертификата не выполнен

source: Status
ru: Статус

source: Confirming the Certificate Signing Request
ru: Подтверждение запроса на подпись сертификата

source: Certificate verification request failed
ru: Запрос на подтверждение сертификата не выполнен

source: Creating a certificate
ru: Создание сертификата

source: Certificate
ru: Сертификат

source: Checking the correctness of the certificate
ru: Проверка корректности сертификата

source: The users private key does not match the generated certificate
ru: Личный ключ пользователя не соответствуют сгенерированному сертификату

source: Enter user password
ru: Введите пароль пользователя

source: in a cluster
ru: в кластере

source: Copying certificate failed
ru: Копирование сертификата неудачное

source: Request to get server API version failed
ru: Запрос на получение API-версии сервера не прошел

source: Generating a user configuration file
ru: Формирование файла конфигурации пользователя

source: User configuration file
ru: Файл конфигурации пользователя

source: Adding context to created user
ru: Добавление контекста созданного пользователя

source: context added
ru: контекст добавлен

source: cluster
ru: кластера

source: The script must be run by a user with rights
ru: Скрипт должен запускаться пользователем с правами

source: In variable
ru: В переменной

source: no privileged command launch directories
ru: нет каталогов запуска привелигированных команд

source: Use
ru: Используйте

source: instead of
ru: вместо

source: exists
ru: существует

source: missing from the system
ru: отсутствует в системе

source: Enter password of user
ru: Введите пароль пользователя

source: Cluster is unavailable
ru: Кластер недоступен

source: configuration file
ru: файл конфигурации

source: Invalid number of parameters
ru: Неверное число параметров

source: Invalid second parameter
ru: Неверный второй параметр

source: not applicable to cluster role
ru: неприменимо к кластерной роли

source: missing from the role link
ru: отсутствует в связке роли
