Repository: alt-cloud/podsec
Catalog: podsec-k8s/po/podsec-k8s.po
Languages: ru

source: Launching the kubelet service
ru: Загорузка kubelet сервиса

source: Initializing the cluster master node
ru: Инициализация master-узла кластера

source: Configuring root as a cluster administrator
ru: Настройка root на роль администратора кластера

source: Setting
ru: Настройка

source: for the role of cluster administrator
ru: на роль администратора кластера

source: Image archiving directory not specified
ru: Не указан каталог архивирования образов

source: Format
ru: Формат

source: <image_archiving_directory> <architecture>,<architecture>
ru: <каталог_архивирования_образов> <архитектура>,<архитектура>

source: No list of architectures specified
ru: Не указан список архитектур

source: Script
ru: Скрипт

source: must be run as root user
ru: должен запускаться от пользователя root

source: Current platform
ru: Текущая платформа

source: does not match the downloaded one
ru: не совпадает с загружаемой

source: Continue
ru: Продолжать

source: Unknown architecture
ru: Неизвестная архитектура

source: Acceptable:
ru: Допустимые:

source: Downloading kubernetes images of architecture
ru: Загрузка kubernetes-образов архитектуры

source: platforms
ru: платформы

source: Entering RootlessKit namespaces
ru: Вход в RootlessKit namespaces

source: nsenter failed after
ru: nsenter упало после

source: attempts, RootlessKit not running
ru: попытки, RootlessKit не работает

source: Incorrect mask
ru: Некорректная маска

source: Incorrect address
ru: Некорректный адрес

source: Variable value
ru: Значение переменной

source: must start with a symbol
ru: должно начитаться с символа

source: Warning
ru: Предупреждение

source: version of kubeadm command
ru: команда kubeadm версии

source: already installed
ru: уже установлена

source: Minor version
ru: Минорная версия

source: matches the established one
ru: совпадает с устанавленной

source: command crio version
ru: команда crio версии

source: less than 1.26 is not supported
ru: менее 1.26 не поддерживается

source: Installing packages
ru: Установка пакетов

source: Version
ru: Версия

source: packages
ru: пакетов

source: unavailable
ru: недоступна

source: Trying to install a previous minor version
ru: Пытаемся установить предыдущую минорную версию

source: Minor version of kubeadm
ru: Минорная версия kubeadm

source: The kubeadm minor version is more than one release behind the kubernetes image minor version. Deployment issues may occur
ru: Минорная версия kubeadm меньше минорной версии kubernetes-образов более чем на один релиз. Возможны проблемы с разворачиванием

source: Kubernet version
ru: Kubernet-версия

source: not supported
ru: не поддерживается

source: Image version
ru: Версия образа

source: with tag
ru: с тегом

source: available. Loading...
ru: доступна. Загружаем...

source: Within the specified minor version
ru: В рамках указанной минорной версии

source: no images available
ru: нет доступных образов

source: The following minor versions are available
ru: Доступны следующие минорные версии

source: and the following patch versions of images
ru: и следующие patch-версии образов

source: To install one of the specified image versions, specify the selected image version in the environment variable
ru: Для установки одной из указанных версий образов укажите выбранную версию образа в переменной среды

source: To install the latest patch versions
ru: Для установки последних patch-версий

source: images set environment variable
ru: образов установите переменную среды

source: or
ru: или

source: Within the framework of the minor version
ru: В рамках минорной версии

source: images
ru: образы

source: are absent
ru: отсутсвуют

source: Selected available on the registry
ru: Выбран доступный на регистраторе

source: last tag
ru: последний тег

source: Image
ru: Образ

source: on registry
ru: на регистраторе

source: Loading the image
ru: Загрузка образа

source: For the image
ru: Для образа

source: image with tag selected
ru: выбран образ с тегом

source: Interface
ru: Интерфейс

source: supports network
ru: поддерживает сеть

source: intersecting with the internal network
ru: пересекающуюся с внутренней сетью

source: kubernetes cluster
ru: kubernetes кластера

source: FORMAT
ru: Формат

source: An etcd cluster data directory was found on the server
ru: На сервере обнаружен каталог данных etcd-кластера

source: from previous deployment. Clear directory? y/N
ru: от предыдущего разворачивания. Очистить каталог? y/N

source: Configuring image usage
ru: Настройка использования образа

source: when starting pods in podman (podman pod init)
ru: при запуска pod'ов в podman (podman pod init)

source: Cluster deployment failed
ru: Разворачивание кластера закончилось неудачно

source: Login as user u7s-admin
ru: Выполните вход в пользователя u7s-admin

source: and check the status with the command
ru: и посмотрите статус командой

source: and system logs with command
ru: и системные логи командой

source: The cluster administrator configuration file is not generated
ru: Конфигурационный файл администратора кластера не сформирован
