Repository: alt-cloud/podsec
Catalog: podsec/po/podsec.po
Languages: ru

source: Enter the password for user
ru: Введите пароль пользователя

source: the container image developer
ru: разработчика образов контейнеров

source: Public key not found
ru: Не найден открытый ключ

source: Invalid repository path description format for user
ru: Неверный формат описания тропы репозитория для пользователя

source: Format
ru: Формат

source: Two matching repository paths
ru: Две совпадающие тропы репозитория

source: The script must be run by a user with root rights.
ru: Скрипт должен запускаться пользователем с правами root

source: Check if the current server is a server that supports the registry (registry.local) and the image signing server (sigstore.local)
ru: Проверка. Является ли текущий сервер сервером, поддерживающий регистратор (registry.local) и сервер подписи образов (sigstore.local)

source: It is not possible to create users of the container image developer class
ru: Создание пользователей класса 'разработчик образов контейнеров' невозможно

source: Signature server directory /var/sigstore/ not created
ru: Не создан каталог /var/sigstore/ сервера подписей

source: Call the podsec-create-policy script to initialize it
ru: Вызовите скрипт podsec-create-policy для его инициализации

source: username
ru: имя_пользователя

source: The IP address of the registry and signature server is not specified
ru: Не указан IP-адрес регистратора и сервера подписей

source: <ip_address_of_registrar_and_signature_server>
ru: <ip-адрес_регистратора_и_сервера_подписей>

source: Only one IP address of the registry and signature server must be specified.
ru: Должен быть указан только один IP-адрес регистратора и сервера подписей\n

source: The IP address of the registry and signature server must not be local
ru: IP-адрес регистратора и сервера подписей не должен быть локальным

source: Invalid IP address
ru: Некорректный IP-адрес

source: Domains registry.local sigstore.local trivy.local are already bound to IP address
ru: Домены registry.local sigstore.local trivy.local уже привязаны к IP адресу

source: Remove the binding and run the script again
ru: Удалите привязку и запустите скрипт заново

source: Adding a binding of domains registry.local sigstore.local trivy.local to IP address
ru: Добавление привязки доменов registry.local sigstore.local trivy.local к IP адресу

source: Creating podman group
ru: Создание группы podman

source: Initializing the
ru: Инициализация

source: directory and subdirectories for storing public keys and image signatures
ru: каталога /var/sigstore/ и подкаталогов хранения открытых ключей и подписей образов

source: Creating the directory and subdirectories
ru: Создание каталога и подкаталогов

source: Creating the podman_dev group
ru: Создание группы podman_dev

source: Creating with preservation of the previous policy file
ru: Создание с сохранением предыдущего файла политик

source: Creating with preservation of the previous file
ru: Создание с сохранением предыдущего файла

source: description of access to public keys of signatories
ru: описания доступа к открытым ключам подписантов

source: Adding insecure access to the registry.local registry in the
ru: Добавление insecure-доступа к регистратору registry.local в

source: Services cannot be started
ru: Запуск сервисов невозможен

source: Service httpd2 is running and conflicts with docker-registry
ru: Сервис httpd2 запущен и конфликтует с docker-registry

source: Service httpd2 stopped
ru: Сервис httpd2 остановлен

source: Domains registry.local sigstore.local in the file /etc/hosts are bound to a remote server with ip
ru: Домены registry.local sigstore.local в файле /etc/hosts привязаны к удаленному серверу с ip

source: Domains registry.local sigstore.local are not specified in the /etc/hosts file.
ru: Домены registry.local sigstore.local в файле /etc/hosts не указаны

source: Run the podsec-create-policy script
ru: Запустите скрипт podsec-create-policy

source: The platform
ru: Платформа

source: is predefined by the variable U7S_PLATFORM. This value is taken.
ru: преопределена переменной U7S_PLATFORM. Принимается это значение.

source: Unable to load images
ru: Невозможно загрузить образ

source: The script is called by a user not included in the podman_dev group
ru: Скрипт вызывается пользователем не входящим в группу podman_dev

source: archive_file_name architecture EMail_signer [registry/path]
ru: имя_архивного_файла архитектура EMail_подписанта [регистратор/тропа]

source: Missing path after registry name
ru: Отсутствует тропа после имени регистратора

source: Archive
ru: Архив

source: is missing
ru: пропущен

source: Unknown architecture
ru: Неизвестная архитектура

source: Allowed: amd64, arm64, arm, ppc64le, 386
ru: Допустимые: amd64, arm64, arm, ppc64le, 386

source: Registry name not specified
ru: Не указано имя регистратора

source: The registry name must contain a period (.) in the name
ru: Имя регистратора должно содержать точку (.) в имени

source: Unsuccessful archive unfolding
ru: Неуспешное разворачивание архива

source: Invalid archive format. Archive directory
ru: Некорректный формат архива. Каталог архива

source: Current platform
ru: Текущая платформа

source: does not match installed
ru: не совпадает c устанавливаемой

source: Continue (y/N)?
ru: Продолжать (y/N)?

source: Deploying the image
ru: Разворачивание образа

source: to the local system
ru: в локальную систему

source: Signing and transferring the
ru: Подпись и передача образа

source: to the registry
ru: в регистратор

source: configPolicyFile has a default policy
ru: В configPolicyFile установлена политика по умолчанию

source: set to something other than reject
ru: отличная от reject

source: The YAML files
ru: YAML файлы

source: are missing the URL of the default signature keeper default-docker.lookaside
ru: отсутствует URL хранителя подписи по умолчанию default-docker.lookaside

source: Workstation
ru: Рабочее место

source: user
ru: пользователь

source: Images outside file policy
ru: Образы вне политики файла

source: Images according to file policy
ru: Образы согласно политики файла

source: Image archiving directory not specified
ru: Не указан каталог архивирования образов

source: archive_deployment_directory [architecture ...] [transport] [image] ...
ru: <каталог_архивирования_образов> <архитектура>,<архитектура>,...|all <транспорт> <образ> ...

source: No list of images specified
ru: Не указан список образов

source: OCI catalog already exists
ru: OCI-каталог уже существует

source: Directory
ru: Каталог

source: is missing. Copying existing images of user u7s-admin is not possible.
ru: отсутствует. Копирование существующих образов пользователя u7s-admin невозможно

source: Archiving the image
ru: Архивация образа

source: Archiving and compressing images\n
ru: Архивания и сжатие образов
