Repository: alt-cloud/podsec
Catalog: podsec-inotify/po/podsec-inotify.po
Languages: ru

source: Format
ru: Формат

source: Building image
ru: Построение образа

source: failed
ru: закончилось неуспешно

source: Image analysis is skipped.
ru: Анализ образа пропускается

source: in home directory
ru: в домашнем каталоге

source: in configuration directory
ru: в каталоге конфигурации

source: An event
ru: Событие

source: occurred in the container
ru: произошло в контейнере

source: on the file
ru: в файле

source: plugin must be run as root user
ru: plugin должен запускаться с правами пользователя root

source: have registry that do not support electronic signatures
ru: имеют регистраторы не поддерживающие электронную подпись

source: users have registry that do not support electronic signatures
ru: пользователи имеют регистраторы не поддерживающие электронную подпись

source: have unsigned images
ru: имеют неподписанные образы

source: users have unsigned images
ru: пользователи имеют неподписанные образы

source: users have images outside of supported policies
ru: пользователи имеют образы вне поддерживаемых политик

source: Users
ru: Пользователи

source: have images that violate established policies
ru: имеют образы нарушающие установленные политики

source: There are users
ru: Есть пользователи

source: Containerization policies are not violated
ru: Политики контейнеризации не нарушены

source: Invalid number of parameters
ru: Неверное число параметров

source: Detected requests to the kubernetes cluster with excess authority
ru: Обнаружен запрос к кластеру kubernetes с превышением полномочий

source: Invalid value for 1st parameter
ru: Неверное значение 1-го параметра

source: outside the podman group
ru: вне группы podman

source: have images but are not in the podman group
ru: имеют образы, но не входят в группу podman

source: capable of receiving any image
ru: способные получать любой образ

source: have defaultPolicy!=reject in policy.json but are not in the podman_dev group
ru: имеют в policy.json defaultPolicy!=reject, но не входят в группу podman_dev

source: capable of getting a local image without a signature
ru: способные получать локальный образ без подписи

source: do not have registry.local in the list of registries for which the presence of digital image signature is checked
ru: не имеют registry.local в списке регистраторов для которых проверяется наличие электронной подписи образов

source: capable of receiving any image without a signature
ru: cпособные получать любой образ без подписи

source: have registries in the policy for which the presence of an electronic image signature is not checked
ru: имеют в политике регистраторы для которых не проверяется наличие электронной подписи образов

source: capable of receiving any image via prohibited transport
ru: способные получать любой образ через запрещенный транспорт

source: have transports other than docker in the list of supported transports
ru: имеют в списке поддерживаемых транспорты отличные от docker

source: not using a local signature store
ru: не использующие локальный хранитель подписей

source: do not use the signature store http://sigstore.local:81/sigstore/ as the default signature store
ru: не используют хранилище подписей http://sigstore.local:81/sigstore/ как хранилище подписей по умолчанию

source: included in the wheel group
ru: входящие в группу wheel

source: users are members of the podman and wheel groups
ru: входят в группы 'podman' и 'wheel'

source: without a config file
ru: не имеющих конфигурационного файла

source: users do not have config file
ru: пользователи не имеют конфигурационного файла

source: able to change configuration
ru: способные изменить конфигурацию

source: users have writable configuration directory
ru: пользователи имеют открытым для записи каталог конфигурации

source: Violation of user containerization policies
ru: Нарушение политик контейнеризации пользователей

source: Vulnerabilities found in image
ru: Найдены уязвимости в образе

source: of user
ru: пользователя

source: The trivy vulnerability analysis command failed
ru: Команда анализа уязвимостей trivy закончилась неуспешно

source: Image
ru: Образ

source: has been deleted
ru: удален

source: In the image
ru: В образе

source: no vulnerabilities found
ru: уязвимости не обнаружены

source: of the user
ru: пользователя

source: critical and high vulnerabilities were discovered
ru: обнаружены критические и высокие уязвимости

source: critical vulnerabilities have been discovered
ru: обнаружены критические уязвимости

source: high vulnerabilities found
ru: обнаружены высокие уязвимости

source: Vulnerabilities were found in the image
ru: Обнаружены уязвимости в образе

source: but none were high or critical
ru: но нет высоких или критических
